[
    {
        "title": "Berkeley Talks - acast",
        "href": "https://feeds.acast.com/public/shows/berkeley-talks",
        "body": "In Berkeley Talks episode 143, a panel of UC Berkeley experts discuss climate displacement — what it means to abandon places, the power dynamics between the Global South and the Global North, challenges for both the sending and receiving regions, and what needs to happen to address this fast-growing problem.. Panelists include faculty members from Berkeleys new cluster in climate equity and ..."
    },
    {
        "title": "The Unplayable Podcast",
        "href": "https://feeds.acast.com/public/shows/62ccf43965d3e90015668328",
        "body": "World champions Australia were thrashed by New Zealand to the tune of 89 runs at the Sydney Cricket Ground, and cricket.com.au journalists Louis Cameron and Josh Schonafinger take a look at what went wrong for the Aussies. Hosted on Acast. See acast.com/privacyfor more information. Instant World Cup Recap: The best catch Ive ever seen"
    },
    {
        "title": "The Stories of Mahabharata - acast",
        "href": "https://feeds.acast.com/public/shows/thestoriesofmahabharata",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. Mahabharata Episode 61: Day Eleven of the War - Duryodhan appoints Dron as the commander-in chief Bhishma lying on a bed of arrows Yudhistir and his brothers beg Bhishma for his life. Bhishma obliges by giving them the only strategy that can kill him."
    },
    {
        "title": "Pediatric Research Podcast",
        "href": "https://feeds.acast.com/public/shows/bf0792d1-9ff8-5db0-8a06-13bcd189b631",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. Placental transfusion during neonatal resuscitation in a preterm model Intraventricular hemorrhage (IVH) occurs in around 45% of infants born below 26 weeks gestational age, causing significant lifelong morbidity and mortality. However, there is currently no effective treatment."
    },
    {
        "title": "Culture Vulture - acast",
        "href": "https://feeds.acast.com/public/shows/60d3c11f7963c7001b0c0397",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. Breakdowns  Nepotism Babies This week is HUGE! Stories about period sex, a note from Wil Wheaton (a former child star), and then a big discussion about what went down on Gabbie Hannas TikTok last week, and how we react to influencers posting through it."
    },
    {
        "title": "VOCAL GIRLS PODCAST - feeds.acast.com",
        "href": "https://feeds.acast.com/public/shows/vocal-girls-podcast",
        "body": "The VOCAL GIRLS podcast is the series where music journalist and VOCAL GIRLS Founder, Megan Graye, chats to artists about their past, present and future, and the music that intertwines these experiences."
    },
    {
        "title": "The Girl Next Door Podcast",
        "href": "https://feeds.acast.com/public/shows/57f5409b938203d57a43285d",
        "body": "From the Loops and golf carts of our past to the decaying bedspreads and fancy vacuums of our present, today were chatting about cheap and splurgy spending habits."
    },
    {
        "title": "The Imperial Senate Podcast - feeds.acast.com",
        "href": "https://feeds.acast.com/public/shows/62704c6813ffdf0012a6ed89",
        "body": "The Imperial Senate Podcast is a show that discusses Star Wars in a uniquely earnest and eccentric fashion!. Join hosts Charlie Ashby, Nicky Kumar  Clare Stribling as they discuss the latest news and reviews with some comedic levity.. Get bonus content on Patreon"
    },
    {
        "title": "Hear Me, See Me Podcast",
        "href": "https://feeds.acast.com/public/shows/hear-me-see-me",
        "body": "Hear Me, See Me Podcast with Steven Kelly. Thai prison nightmare. I met Steven at my friends Kickboxing Gym and his story is amazing. Steven is by no means an angel, and doesnt profess to be however he is trying to make good in his life and trying to be an inspiration to others who may take that path."
    },
    {
        "title": "Death Valley Girls Podcast",
        "href": "https://feeds.acast.com/public/shows/death-valley-girls-podcast",
        "body": "Today we have our friend and hero, Patience Berkel on the podcast! Patience is a funeral arranger and embalming apprentice! Here we talk turkey about the American funeral and death industry!"
    },
    {
        "title": "The History of England - acast",
        "href": "https://feeds.acast.com/public/shows/9c4dc3cd-147f-442d-b0d3-033f45c2648c",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. 352 A Beard Unsinged For Charles I, April to June 1625 was his like the honeymoon period given to new football managers - enthusiastic full of hope - and often depressingly brief. The honeymoon period with his newly arrived wife Henrietta Maria, was similarly brief. Hosted on Acast."
    },
    {
        "title": "Red Box Politics Podcast",
        "href": "https://feeds.acast.com/public/shows/timesredbox",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. How To Build A House Matt Chorley is joined by Times Radios Lucy Fisher and Patrick Maguire from The Times Red Box live on stage at the Cheltenham Literature Festival, pausing the action to analyse the exchanges between Liz Truss and Keir Starmer at PMQs."
    },
    {
        "title": "DumTeeDum - A show about BBC Radios The Archers - acast",
        "href": "https://feeds.acast.com/public/shows/bd05403f-2ed0-413f-a9b2-09c2664e8920",
        "body": "See acast.com/privacyfor more information. It was a bit of an all creatures great and small week Marcus Morgan Bentley is a British actor, broadcaster and famed voice-over artist most known for narrating the UK version of Big Brother since its inception in 2000. Hosted on Acast. See acast.com/privacyfor more information."
    },
    {
        "title": "Neuropsychopharmacology Podcast",
        "href": "https://feeds.acast.com/public/shows/1b454f3a-002e-540e-82a0-3e5bcb0b5da9",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. A scientific approach to navigating the academic job market Driving while under the influence of THC, known as drugged driving, is becoming more of an issue as more states legalize cannabis for both medical and recreational use around the country."
    },
    {
        "title": "The Shortlist - Libsyn",
        "href": "https://feeds.acast.com/public/shows/62dec0d30f00290012239a7d",
        "body": "See acast.com/privacyfor more information. The Best Daily Shows of 2020 Its awards week! This Saturday well be streaming the awards live at britishpodcastawards.com, with hosts Clara Amfo and Rhianna Dhillon. To help get you in the mood, heres the nominees for Best Comedy Podcast, supported by Acast, chosen by over sixty independent judges."
    },
    {
        "title": "The Media Podcast with Matt Deegan",
        "href": "https://feeds.acast.com/public/shows/themediapodcast",
        "body": "In the 200th episode of The Media Podcast, host Ann Charles takes us through the latest media news. Kate Bulkey (Media analyst, Broadcast columnist), freshly returned from Cannes, shares the gossip from the global TV industry conference MIPCOM."
    },
    {
        "title": "ABB Decoded - acast",
        "href": "https://feeds.acast.com/public/shows/5fc0f0ef7a727e2983d0dd40",
        "body": "In a fast-changing world, it can be hard to keep up with the latest developments in technology and sustainability. But thats where the ABB Decoded family of podcasts aims to help."
    },
    {
        "title": "Mid-Atlantic - conversations about US, UK and world politics - acast",
        "href": "https://feeds.acast.com/public/shows/midatlantic",
        "body": "The midterms traditionally mean disaster for the presidents party. However, things may be different this year, so we ask why the electoral hopes for the Dems are so high with the economy reeling from high inflation and uncertainty about whether the country will slip into recession."
    },
    {
        "title": "The Hub on iRadio With Louise Clarke - acast",
        "href": "https://feeds.acast.com/public/shows/thehub",
        "body": "The research comes in light of Meat and Dairy Facts efforts to provide trustworthy and accessible information to Irish women of all ages and life stages on their dietary requirements. Key research findings include: One third (33%) of Irish women aged 20-24 (21% of all women surveyed) believe that women and men have the same dietary requirements."
    },
    {
        "title": "RetainFM - acast",
        "href": "https://feeds.acast.com/public/shows/marketing-development-podcast",
        "body": "In this epsiode I walk you through the process we have honed of writing Standard Operating Procedures (SOPs) - an SOP for SOPs! All of our processes follow the structure of: Define Prerequisites Define Outcome Document Process Define Completion Resources Required Glossary of Terms Where to get help"
    },
    {
        "title": "Heredity Podcast",
        "href": "https://feeds.acast.com/public/shows/heredity-podcast-naturecom-science-feeds",
        "body": "In this episode we showcase a talk given on the day by Prof. Alison Woollard (University of Oxford) titled: Mendel to Modern Genetics. You can find a recording of the full event on the Genetics Societys YouTube Channel. You can also find the Heredity Special Issue - Mendel 200th birthday, here. Hosted on Acast."
    },
    {
        "title": "Between You And Me - A Podcast About Marillion",
        "href": "https://feeds.acast.com/public/shows/5f57907317370644246453f1",
        "body": "See acast.com/privacyfor more information. Market Street Preachers Were not kidding: this episode features Marillion music that most people have never heard before, dating from the Clutching At Straws writing sessions. Just when you thought youd heard it all, something like this gets unearthed!"
    },
    {
        "title": "AVKAST - handbollspodden",
        "href": "https://feeds.acast.com/public/shows/avkast",
        "body": "Avkast går igenom de största snackisarna från handbollsvärlden tillsammans med gästerexperter som Charlie Sjöstrand, Josef Pujol och Emil Berggren."
    },
    {
        "title": "Tisdagspodden - acast",
        "href": "https://feeds.acast.com/public/shows/tisdagspodden",
        "body": "Fakta/statistik hämtat ifrån: BRÅ. Inget att vänta på - Handbok mot våld. Barn som upplever våld (www.Barnafrid.se)Våldsbrott i nära relationer och sexualbrott mot vuxna (Granskningsrapport 2019, dnr A252.474/2018 Polismyndigheten.). Fördjupning:"
    },
    {
        "title": "Nerdelandslaget - acast",
        "href": "https://feeds.acast.com/public/shows/nerdelandslaget",
        "body": "Til alle som jobber i VisitJevnaker: IKKE HØR PÅ DENNE EPISODEN! Vi har nemlig besøk av skuespiller, improvisatør og Jevnakerhater Andreas Skjellum Tønnesland i ukas episode, og han maler ikke det vakreste bildet av den lille bygda ved Randsfjorden 😅"
    },
    {
        "title": "Bezimienny - acast",
        "href": "https://feeds.acast.com/public/shows/bezimienny",
        "body": "No i wracamy. Tym razem z Japońszczyzną, która notabene ma szansę być grą sprzedającą konsolę Nintendo Switch. Z drugiej strony, ta konsolka tak świetnie się rozchodzi, że takie tytuły dopełniają już i tak ogromny sukces Niny w ilości sprzedanych egzemplarzy."
    },
    {
        "title": "The Gigglefix Podcast - feeds.acast.com",
        "href": "https://feeds.acast.com/public/shows/6171417bf77e7a0012d5af75",
        "body": "See acast.com/privacyfor more information. A Gigglefix Special with Daniel Lill DEATH, on his way to the new carnage at The Broken Drum, has bumped into Rincewind as the wizzard struggles with doing the right thing about the missing Twoflower. What should he do, and most importantly, how the flip is he going to do it? Whatever it is."
    },
    {
        "title": "Achtung! Millwall Podcast",
        "href": "https://feeds.acast.com/public/shows/d67059cd-c552-48a5-9cb4-a8bc78b75257",
        "body": "Continuing his fine series of Millwall history accounts, were joined by author, publisher and Millwall fan Merv Payne. Daydreams and Nightmares: Millwall FC in the early 2000s can be ordered via www.victorpublishing.co.uk - £10.99 +pp."
    },
    {
        "title": "The Unused Substitutes - acast",
        "href": "https://feeds.acast.com/public/shows/unusedsubspod",
        "body": "Hosted on Acast. See acast.com/privacyfor more information. The Unused Substitutes The Unused Substitutes The whole gang is here to talk about the loss to Charleston, where they think the Rowdies will end up after the final few games, and share some news about the future. Hosted on Acast. See acast.com/privacyfor more information. Talk Hard"
    },
    {
        "title": "The Square Ball: Leeds United Podcast",
        "href": "https://feeds.acast.com/public/shows/281cce9e-c490-44ba-ba78-7a7db39b60c6",
        "body": "To mark the 10 year anniversary of the passing of Gary Speed we thought we should do something big, befitting Garys stature within the game. So Dan and Michael from the podcast are leading a crack team of Leeds United fans on a 92 mile odyssey from North Wales, where Gary Speed grew up, back to Leeds - all to raise money for Andys Man Club and the Samaritans."
    },
    {
        "title": "Team Human - acast",
        "href": "https://feeds.acast.com/public/shows/teamhuman",
        "body": "Playing for Team Human today, its Team Human! Douglas Rushkoff hosts the third Team Human call-in show from the community Discord server. He fields questions from community members about Survival of the Richest: Escape Fantasies of the Tech Billionaires, the possibilities of Web3 after Ethereums swtich from proof-of-work to proof-of-stake, and how we can find hope in entertainment."
    },
    {
        "title": "Inside the Box - acast",
        "href": "https://feeds.acast.com/public/shows/606c5318b9b65c05c209bc18",
        "body": "Inside the Box ger sig in i politiken! I det här avsnittet möter du Ida Östenberg (professor i antikens kultur och samhällsliv vid Göteborgs universitet) och Petra Holmberg (konstvetare och Japan-intendent på Världskulturmuseerna) i ett samtal om propaganda och makt i kejsartidens Rom och andra världskrigets Japan.. Tillsammans med gästerna monterar programledaren Lisa Haeger isär ..."
    },
    {
        "title": "Litteraturhuset Fredrikstad - acast",
        "href": "https://feeds.acast.com/public/shows/litteraturhuset-fredrikstad",
        "body": "Andrej Kurkov regnes som Ukrainas viktigste forfatter. I denne podcastepisoden møter du ham i samtale med tidligere NRK-anker Ole Torp. Her får du Kurkovs vurderinger og skildringer av krigen i Ukraina, sett fra innsiden."
    }
]